artillery/assets-load-test.yml
config:
#  target: "https://poc.sandbox.jugo.io"
  target: "https://02w3yjlc6f.execute-api.eu-west-1.amazonaws.com/prod"
  phases:
    - duration: 30
      arrivalRate: 10
  http:
    defaults:
      headers:
        Authorization: "{{ $env.TOKEN }}"
scenarios:
  - name: "Put asset"
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              mutation CreateAsset($input: NewAsset!) {
                createAsset(input: $input) {
                  ID
                  Name
                  Description
                  URI
                  CreatedAt
                  UpdatedAt
                  Owner
                }
              }
            variables:
              input:
                Name: "artillery-asset-name-{{ $randomString() }}"
                Description: "artillery-asset-description-{{ $randomString() }}"
                URI: "s3://artillery-fake-bucket/{{ $randomString() }}"
  - name: "Get assets (x1000)"
    flow:
      - loop:
          - post:
              url: "/graphql"
              json:
                query: |
                  query Assets {
                    assets {
                      ID
                      Name
                      Description
                      URI
                      CreatedAt
                      UpdatedAt
                    }
                  }
        count: 1000