artillery/assets-load-test.yml
config:
#  target: "https://poc.sandbox.jugo.io"
  target: "https://02w3yjlc6f.execute-api.eu-west-1.amazonaws.com/prod"
  phases:
    - duration: 30
      arrivalRate: 100
  http:
    defaults:
      headers:
        Authorization: "{{ $env.TOKEN }}"
scenarios:
  - name: "Get assets"
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query Assets {
                assets {
                  ID
                  Name
                  Description
                  URI
                  CreatedAt
                  UpdatedAt
                }
              }
#          capture:
#            - json: "$"
#              as: "body"
#      - log: "Response: {{ body }}"