artillery/assets-seed.yml
config:
  target: "https://poc.sandbox.jugo.io"
  phases:
    - duration: 1
      arrivalRate: 30
  http:
    defaults:
      headers:
        Authorization: "{{ $env.TOKEN }}"
scenarios:
  - name: "Create assets"
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              mutation CreateAsset($input: NewAsset!) {
                createAsset(input: $input) {
                  ID
                  Name
                  Description
                  URI
                  CreatedAt
                  UpdatedAt
                  Owner
                }
              }
            variables:
              input:
                Name: "artillery-asset-name-{{ $randomString() }}"
                Description: "artillery-asset-description-{{ $randomString() }}"
                URI: "s3://artillery-fake-bucket/{{ $randomString() }}"
          capture:
            - json: "$.data.createAsset.ID"
              as: "assetId"